#9. Дано ціле число N (> 0). Знайти число, отримане при прочитанні числа N справа наліво та добуток
#його цифр.
n1 = input("Введите целое число :" )
n2 = n1[::-1]
print("результат роботы = ", n2)



